Autodesk.Revit.DB.CurveElementFilter.CurveElementType
The curve element type.
Since:
2011

Autodesk.Revit.DB.CurveElementFilter.#ctor(Autodesk.Revit.DB.CurveElementType,System.Boolean)
Constructs a new instance of a filter to match specific types of curve elements,
with the option to match all curves which are not of the given curve type.
curveElementType:
The curve element type to match.
inverted:
True if the filter should match all curves which are not of the given curve type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.CurveElementFilter.#ctor(Autodesk.Revit.DB.CurveElementType)
Constructs a new instance of a filter to match specific types of curve elements.
curveElementType:
The curve element type to match.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.CurveElementFilter
A filter used to pass curve elements which are of a specific type.
Since:
2011